IF NOT EXISTS (SELECT "εκπ".id FROM 
"ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ" 
JOIN TEMP 
ON "εκπ"."αμ" = TEMP."Α.Μ."
LIMIT 1)
BEGIN
INSERT INTO TABLE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" 
    (
        "ονομα",
        "επωνυμο" ,
        "πατρωνυμο",
        "αμ",
        "αφμ",
        "διευθυνση_κατ",
        "τκ",
        "τηλεφωνο",
        "τηλεφωνο_κιν",
        "τηλεφωνο_2",
        "email",
        "διευθυντης",
        "υποδιευθυντης",
        "υποχρ_ωραριο_υπηρ_φορεα",
        "μειωση_ωραριου")        
SELECT 
        "Όνομα",
        "Επώνυμο",
        "Πατρώνυμο",
        "Α.Μ.",
        "Α.Φ.Μ.",
        "Διεύθυνση Κατοικίας",
        "Τ.Κ.",
        "Τηλέφωνο εκπαιδευτικού",
        "Κινητό Τηλέφωνο εκπαιδευτικού",
        "2ο Τηλέφωνο εκπαιδευτικού",
        "Email εκπαιδευτικού",
        "Διευθυντής Σχολείου",
        "Υποδιευθυντής Σχολείου",
        "Ώρες Υποχ. Διδακτικού Ωραρίου Υπηρέτησης στο Φορέα",
        "Μείωση Ωραρίου"
FROM TEMP;

INSERT INTO TABLE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" (
        "φυλο_id",
        "κατηγορια_μοριοδ_id",
        "περιοχη_μεταθ_id",
        "σχεση_εργ_id",
        "ειδικοτητα_κωδ",
        "ειδικοτητα_2_κωδ"
        )
VALUES
    ( 
        SELECT "ΦΥΛΟ".id FROM "ΦΥΛΟ" JOIN TEMP ON "ΦΥΛΟ"."φυλο"=TEMP."Φύλο",
        SELECT "κμ".id FROM "ΚΑΤΗΓΟΡΙΑ_ΜΟΡΙΟΔΟΤΗΣΗΣ" "κμ" JOIN TEMP ON "κμ"."κατηγορια_μοριοδ"=TEMP."Κατηγορία Μοριοδότησης",
        SELECT "πμ".id FROM "ΠΕΡΙΟΧΕΣ_ΜΕΤΑΘΕΣΗΣ" "πμ" JOIN TEMP ON "πμ"."περιοχη_μεταθ"=TEMP."Περιοχή Μετάθεσης Εκπαιδευτικού",
        SELECT "σχερ".id FROM "ΣΧΕΣΗ_ΕΡΓΑΣΙΑΣ" "σχερ" JOIN TEMP ON "σχερ"."σχεση_ερ"=TEMP."Σχέση Εργασίας",
        SELECT "ειδ1".id FROM "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ1" JOIN TEMP ON "ειδ1"."ειδικ_κωδικος"=TEMP."Κωδικός Κύριας Ειδικότητας",
        SELECT "ειδ2".id FROM "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ2" LEFT JOIN TEMP ON "ειδ2"."ειδικ_κωδικος"=TEMP."Κωδικός 2ης Ειδικότητας"
    )
END
ELSE
BEGIN
UPDATE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
SET
    "εκπ"."ονομα"=TEMP."Όνομα",
    "εκπ"."επωνυμο"=TEMP."Επώνυμο",
    "εκπ"."πατρωνυμο"=TEMP."Πατρώνυμο",
    "εκπ"."αμ"=TEMP."Α.Μ." ,
    "εκπ"."αφμ"=TEMP."Α.Φ.Μ.",
    "εκπ"."διευθυνση_κατ"=TEMP."Διεύθυνση Κατοικίας" ,
    "εκπ"."τκ"=TEMP."Τ.Κ.",
    "εκπ"."τηλεφωνο"=TEMP."Τηλέφωνο εκπαιδευτικού",
    "εκπ"."τηλεφωνο_κιν"=TEMP."Κινητό Τηλέφωνο εκπαιδευτικού",
    "εκπ"."τηλεφωνο_2"=TEMP."2ο Τηλέφωνο εκπαιδευτικού",
    "εκπ"."email"=TEMP."Email εκπαιδευτικού",
    "εκπ"."διευθυντης"=TEMP."Διευθυντής Σχολείου",
    "εκπ"."υποδιευθυντης"=TEMP."Υποδιευθυντής Σχολείου",
    "εκπ"."υποχρ_ωραριο_υπηρ_φορεα"=TEMP."Ώρες Υποχ. Διδακτικού Ωραρίου Υπηρέτησης στο Φορέα",
    "εκπ"."μειωση_ωραριου"=TEMP."Μείωση Ωραρίου"
FROM "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
JOIN TEMP 
    ON "εκπ"."αμ" = TEMP."Α.Μ.";

UPDATE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
SET
    "φυλο_id" = "φ".id,
    "κατηγορια_μοριοδ_id" = "κμ".id,
    "περιοχη_μεταθ_id" = "πμ".id,
    "σχεση_εργ_id" = "σχερ".id,
    "ειδικοτητα_κωδ" = "ειδ1".id,
    "ειδικοτητα_2_κωδ" = "ειδ2".id
FROM TEMP
JOIN "ΦΥΛΟ" "φ"
    ON "φ"."φυλο" = TEMP."Φύλο"
JOIN "ΚΑΤΗΓΟΡΙΑ_ΜΟΡΙΟΔΟΤΗΣΗΣ" "κμ"
    ON "κμ"."κατηγορια_μοριοδ" = TEMP."Κατηγορία Μοριοδότησης"
JOIN "ΠΕΡΙΟΧΕΣ_ΜΕΤΑΘΕΣΗΣ" "πμ"
    ON "πμ"."περιοχη_μεταθ" = TEMP."Περιοχή Μετάθεσης Εκπαιδευτικού"
JOIN "ΣΧΕΣΗ_ΕΡΓΑΣΙΑΣ" "σχερ"
    ON "σχερ"."σχεση_ερ" = TEMPt."Σχέση Εργασίας"
JOIN "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ1"
    ON "ειδ1"."ειδικ_κωδικος" = TEMP."Κωδικός Κύριας Ειδικότητας"
LEFT JOIN "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ2"
    ON "ειδ2"."ειδικ_κωδικος" = TEMP."Κωδικός 2ης Ειδικότητας"
WHERE "εκπ"."αμ" = TEMP."Α.Μ.";


--! SXOLEIA

IF NOT EXISTS (SELECT "εκπ".id FROM 
"ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ" 
JOIN TEMP 
ON "εκπ"."αμ" = TEMP."Α.Μ."
LIMIT 1)
BEGIN
INSERT INTO TABLE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" 
    (
        "ονομα",
        "επωνυμο" ,
        "πατρωνυμο",
        "αμ",
        "αφμ",
        "διευθυνση_κατ",
        "τκ",
        "τηλεφωνο",
        "τηλεφωνο_κιν",
        "τηλεφωνο_2",
        "email",
        "διευθυντης",
        "υποδιευθυντης",
        "υποχρ_ωραριο_υπηρ_φορεα",
        "μειωση_ωραριου")        
SELECT 
        "Όνομα",
        "Επώνυμο",
        "Πατρώνυμο",
        "Α.Μ.",
        "Α.Φ.Μ.",
        "Διεύθυνση Κατοικίας",
        "Τ.Κ.",
        "Τηλέφωνο εκπαιδευτικού",
        "Κινητό Τηλέφωνο εκπαιδευτικού",
        "2ο Τηλέφωνο εκπαιδευτικού",
        "Email εκπαιδευτικού",
        "Διευθυντής Σχολείου",
        "Υποδιευθυντής Σχολείου",
        "Ώρες Υποχ. Διδακτικού Ωραρίου Υπηρέτησης στο Φορέα",
        "Μείωση Ωραρίου"
FROM TEMP;

INSERT INTO TABLE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" (
        "φυλο_id",
        "κατηγορια_μοριοδ_id",
        "περιοχη_μεταθ_id",
        "σχεση_εργ_id",
        "ειδικοτητα_κωδ",
        "ειδικοτητα_2_κωδ"
        )
VALUES
    ( 
        SELECT "ΦΥΛΟ".id FROM "ΦΥΛΟ" JOIN TEMP ON "ΦΥΛΟ"."φυλο"=TEMP."Φύλο",
        SELECT "κμ".id FROM "ΚΑΤΗΓΟΡΙΑ_ΜΟΡΙΟΔΟΤΗΣΗΣ" "κμ" JOIN TEMP ON "κμ"."κατηγορια_μοριοδ"=TEMP."Κατηγορία Μοριοδότησης",
        SELECT "πμ".id FROM "ΠΕΡΙΟΧΕΣ_ΜΕΤΑΘΕΣΗΣ" "πμ" JOIN TEMP ON "πμ"."περιοχη_μεταθ"=TEMP."Περιοχή Μετάθεσης Εκπαιδευτικού",
        SELECT "σχερ".id FROM "ΣΧΕΣΗ_ΕΡΓΑΣΙΑΣ" "σχερ" JOIN TEMP ON "σχερ"."σχεση_ερ"=TEMP."Σχέση Εργασίας",
        SELECT "ειδ1".id FROM "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ1" JOIN TEMP ON "ειδ1"."ειδικ_κωδικος"=TEMP."Κωδικός Κύριας Ειδικότητας",
        SELECT "ειδ2".id FROM "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ2" LEFT JOIN TEMP ON "ειδ2"."ειδικ_κωδικος"=TEMP."Κωδικός 2ης Ειδικότητας"
    )
END
ELSE
BEGIN
UPDATE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
SET
    "εκπ"."ονομα"=TEMP."Όνομα",
    "εκπ"."επωνυμο"=TEMP."Επώνυμο",
    "εκπ"."πατρωνυμο"=TEMP."Πατρώνυμο",
    "εκπ"."αμ"=TEMP."Α.Μ." ,
    "εκπ"."αφμ"=TEMP."Α.Φ.Μ.",
    "εκπ"."διευθυνση_κατ"=TEMP."Διεύθυνση Κατοικίας" ,
    "εκπ"."τκ"=TEMP."Τ.Κ.",
    "εκπ"."τηλεφωνο"=TEMP."Τηλέφωνο εκπαιδευτικού",
    "εκπ"."τηλεφωνο_κιν"=TEMP."Κινητό Τηλέφωνο εκπαιδευτικού",
    "εκπ"."τηλεφωνο_2"=TEMP."2ο Τηλέφωνο εκπαιδευτικού",
    "εκπ"."email"=TEMP."Email εκπαιδευτικού",
    "εκπ"."διευθυντης"=TEMP."Διευθυντής Σχολείου",
    "εκπ"."υποδιευθυντης"=TEMP."Υποδιευθυντής Σχολείου",
    "εκπ"."υποχρ_ωραριο_υπηρ_φορεα"=TEMP."Ώρες Υποχ. Διδακτικού Ωραρίου Υπηρέτησης στο Φορέα",
    "εκπ"."μειωση_ωραριου"=TEMP."Μείωση Ωραρίου"
FROM "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
JOIN TEMP 
    ON "εκπ"."αμ" = TEMP."Α.Μ.";

UPDATE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
SET
    "φυλο_id" = "φ".id,
    "κατηγορια_μοριοδ_id" = "κμ".id,
    "περιοχη_μεταθ_id" = "πμ".id,
    "σχεση_εργ_id" = "σχερ".id,
    "ειδικοτητα_κωδ" = "ειδ1".id,
    "ειδικοτητα_2_κωδ" = "ειδ2".id
FROM TEMP
JOIN "ΦΥΛΟ" "φ"
    ON "φ"."φυλο" = TEMP."Φύλο"
JOIN "ΚΑΤΗΓΟΡΙΑ_ΜΟΡΙΟΔΟΤΗΣΗΣ" "κμ"
    ON "κμ"."κατηγορια_μοριοδ" = TEMP."Κατηγορία Μοριοδότησης"
JOIN "ΠΕΡΙΟΧΕΣ_ΜΕΤΑΘΕΣΗΣ" "πμ"
    ON "πμ"."περιοχη_μεταθ" = TEMP."Περιοχή Μετάθεσης Εκπαιδευτικού"
JOIN "ΣΧΕΣΗ_ΕΡΓΑΣΙΑΣ" "σχερ"
    ON "σχερ"."σχεση_ερ" = TEMPt."Σχέση Εργασίας"
JOIN "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ1"
    ON "ειδ1"."ειδικ_κωδικος" = TEMP."Κωδικός Κύριας Ειδικότητας"
LEFT JOIN "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ2"
    ON "ειδ2"."ειδικ_κωδικος" = TEMP."Κωδικός 2ης Ειδικότητας"
WHERE "εκπ"."αμ" = TEMP."Α.Μ.";

--! TOPOTHETISEIS

IF NOT EXISTS (SELECT "εκπ".id FROM 
"ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ" 
JOIN TEMP 
ON "εκπ"."αμ" = TEMP."Α.Μ."
LIMIT 1)
BEGIN
INSERT INTO TABLE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" 
    (
        "ονομα",
        "επωνυμο" ,
        "πατρωνυμο",
        "αμ",
        "αφμ",
        "διευθυνση_κατ",
        "τκ",
        "τηλεφωνο",
        "τηλεφωνο_κιν",
        "τηλεφωνο_2",
        "email",
        "διευθυντης",
        "υποδιευθυντης",
        "υποχρ_ωραριο_υπηρ_φορεα",
        "μειωση_ωραριου")        
SELECT 
        "Όνομα",
        "Επώνυμο",
        "Πατρώνυμο",
        "Α.Μ.",
        "Α.Φ.Μ.",
        "Διεύθυνση Κατοικίας",
        "Τ.Κ.",
        "Τηλέφωνο εκπαιδευτικού",
        "Κινητό Τηλέφωνο εκπαιδευτικού",
        "2ο Τηλέφωνο εκπαιδευτικού",
        "Email εκπαιδευτικού",
        "Διευθυντής Σχολείου",
        "Υποδιευθυντής Σχολείου",
        "Ώρες Υποχ. Διδακτικού Ωραρίου Υπηρέτησης στο Φορέα",
        "Μείωση Ωραρίου"
FROM TEMP;

INSERT INTO TABLE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" (
        "φυλο_id",
        "κατηγορια_μοριοδ_id",
        "περιοχη_μεταθ_id",
        "σχεση_εργ_id",
        "ειδικοτητα_κωδ",
        "ειδικοτητα_2_κωδ"
        )
VALUES
    ( 
        SELECT "ΦΥΛΟ".id FROM "ΦΥΛΟ" JOIN TEMP ON "ΦΥΛΟ"."φυλο"=TEMP."Φύλο",
        SELECT "κμ".id FROM "ΚΑΤΗΓΟΡΙΑ_ΜΟΡΙΟΔΟΤΗΣΗΣ" "κμ" JOIN TEMP ON "κμ"."κατηγορια_μοριοδ"=TEMP."Κατηγορία Μοριοδότησης",
        SELECT "πμ".id FROM "ΠΕΡΙΟΧΕΣ_ΜΕΤΑΘΕΣΗΣ" "πμ" JOIN TEMP ON "πμ"."περιοχη_μεταθ"=TEMP."Περιοχή Μετάθεσης Εκπαιδευτικού",
        SELECT "σχερ".id FROM "ΣΧΕΣΗ_ΕΡΓΑΣΙΑΣ" "σχερ" JOIN TEMP ON "σχερ"."σχεση_ερ"=TEMP."Σχέση Εργασίας",
        SELECT "ειδ1".id FROM "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ1" JOIN TEMP ON "ειδ1"."ειδικ_κωδικος"=TEMP."Κωδικός Κύριας Ειδικότητας",
        SELECT "ειδ2".id FROM "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ2" LEFT JOIN TEMP ON "ειδ2"."ειδικ_κωδικος"=TEMP."Κωδικός 2ης Ειδικότητας"
    )
END
ELSE
BEGIN
UPDATE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
SET
    "εκπ"."ονομα"=TEMP."Όνομα",
    "εκπ"."επωνυμο"=TEMP."Επώνυμο",
    "εκπ"."πατρωνυμο"=TEMP."Πατρώνυμο",
    "εκπ"."αμ"=TEMP."Α.Μ." ,
    "εκπ"."αφμ"=TEMP."Α.Φ.Μ.",
    "εκπ"."διευθυνση_κατ"=TEMP."Διεύθυνση Κατοικίας" ,
    "εκπ"."τκ"=TEMP."Τ.Κ.",
    "εκπ"."τηλεφωνο"=TEMP."Τηλέφωνο εκπαιδευτικού",
    "εκπ"."τηλεφωνο_κιν"=TEMP."Κινητό Τηλέφωνο εκπαιδευτικού",
    "εκπ"."τηλεφωνο_2"=TEMP."2ο Τηλέφωνο εκπαιδευτικού",
    "εκπ"."email"=TEMP."Email εκπαιδευτικού",
    "εκπ"."διευθυντης"=TEMP."Διευθυντής Σχολείου",
    "εκπ"."υποδιευθυντης"=TEMP."Υποδιευθυντής Σχολείου",
    "εκπ"."υποχρ_ωραριο_υπηρ_φορεα"=TEMP."Ώρες Υποχ. Διδακτικού Ωραρίου Υπηρέτησης στο Φορέα",
    "εκπ"."μειωση_ωραριου"=TEMP."Μείωση Ωραρίου"
FROM "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
JOIN TEMP 
    ON "εκπ"."αμ" = TEMP."Α.Μ.";

UPDATE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
SET
    "φυλο_id" = "φ".id,
    "κατηγορια_μοριοδ_id" = "κμ".id,
    "περιοχη_μεταθ_id" = "πμ".id,
    "σχεση_εργ_id" = "σχερ".id,
    "ειδικοτητα_κωδ" = "ειδ1".id,
    "ειδικοτητα_2_κωδ" = "ειδ2".id
FROM TEMP
JOIN "ΦΥΛΟ" "φ"
    ON "φ"."φυλο" = TEMP."Φύλο"
JOIN "ΚΑΤΗΓΟΡΙΑ_ΜΟΡΙΟΔΟΤΗΣΗΣ" "κμ"
    ON "κμ"."κατηγορια_μοριοδ" = TEMP."Κατηγορία Μοριοδότησης"
JOIN "ΠΕΡΙΟΧΕΣ_ΜΕΤΑΘΕΣΗΣ" "πμ"
    ON "πμ"."περιοχη_μεταθ" = TEMP."Περιοχή Μετάθεσης Εκπαιδευτικού"
JOIN "ΣΧΕΣΗ_ΕΡΓΑΣΙΑΣ" "σχερ"
    ON "σχερ"."σχεση_ερ" = TEMPt."Σχέση Εργασίας"
JOIN "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ1"
    ON "ειδ1"."ειδικ_κωδικος" = TEMP."Κωδικός Κύριας Ειδικότητας"
LEFT JOIN "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ2"
    ON "ειδ2"."ειδικ_κωδικος" = TEMP."Κωδικός 2ης Ειδικότητας"
WHERE "εκπ"."αμ" = TEMP."Α.Μ.";

--! ORARIA

IF NOT EXISTS (SELECT "εκπ".id FROM 
"ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ" 
JOIN TEMP 
ON "εκπ"."αμ" = TEMP."Α.Μ."
LIMIT 1)
BEGIN
INSERT INTO TABLE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" 
    (
        "ονομα",
        "επωνυμο" ,
        "πατρωνυμο",
        "αμ",
        "αφμ",
        "διευθυνση_κατ",
        "τκ",
        "τηλεφωνο",
        "τηλεφωνο_κιν",
        "τηλεφωνο_2",
        "email",
        "διευθυντης",
        "υποδιευθυντης",
        "υποχρ_ωραριο_υπηρ_φορεα",
        "μειωση_ωραριου")        
SELECT 
        "Όνομα",
        "Επώνυμο",
        "Πατρώνυμο",
        "Α.Μ.",
        "Α.Φ.Μ.",
        "Διεύθυνση Κατοικίας",
        "Τ.Κ.",
        "Τηλέφωνο εκπαιδευτικού",
        "Κινητό Τηλέφωνο εκπαιδευτικού",
        "2ο Τηλέφωνο εκπαιδευτικού",
        "Email εκπαιδευτικού",
        "Διευθυντής Σχολείου",
        "Υποδιευθυντής Σχολείου",
        "Ώρες Υποχ. Διδακτικού Ωραρίου Υπηρέτησης στο Φορέα",
        "Μείωση Ωραρίου"
FROM TEMP;

INSERT INTO TABLE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" (
        "φυλο_id",
        "κατηγορια_μοριοδ_id",
        "περιοχη_μεταθ_id",
        "σχεση_εργ_id",
        "ειδικοτητα_κωδ",
        "ειδικοτητα_2_κωδ"
        )
VALUES
    ( 
        SELECT "ΦΥΛΟ".id FROM "ΦΥΛΟ" JOIN TEMP ON "ΦΥΛΟ"."φυλο"=TEMP."Φύλο",
        SELECT "κμ".id FROM "ΚΑΤΗΓΟΡΙΑ_ΜΟΡΙΟΔΟΤΗΣΗΣ" "κμ" JOIN TEMP ON "κμ"."κατηγορια_μοριοδ"=TEMP."Κατηγορία Μοριοδότησης",
        SELECT "πμ".id FROM "ΠΕΡΙΟΧΕΣ_ΜΕΤΑΘΕΣΗΣ" "πμ" JOIN TEMP ON "πμ"."περιοχη_μεταθ"=TEMP."Περιοχή Μετάθεσης Εκπαιδευτικού",
        SELECT "σχερ".id FROM "ΣΧΕΣΗ_ΕΡΓΑΣΙΑΣ" "σχερ" JOIN TEMP ON "σχερ"."σχεση_ερ"=TEMP."Σχέση Εργασίας",
        SELECT "ειδ1".id FROM "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ1" JOIN TEMP ON "ειδ1"."ειδικ_κωδικος"=TEMP."Κωδικός Κύριας Ειδικότητας",
        SELECT "ειδ2".id FROM "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ2" LEFT JOIN TEMP ON "ειδ2"."ειδικ_κωδικος"=TEMP."Κωδικός 2ης Ειδικότητας"
    )
END
ELSE
BEGIN
UPDATE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
SET
    "εκπ"."ονομα"=TEMP."Όνομα",
    "εκπ"."επωνυμο"=TEMP."Επώνυμο",
    "εκπ"."πατρωνυμο"=TEMP."Πατρώνυμο",
    "εκπ"."αμ"=TEMP."Α.Μ." ,
    "εκπ"."αφμ"=TEMP."Α.Φ.Μ.",
    "εκπ"."διευθυνση_κατ"=TEMP."Διεύθυνση Κατοικίας" ,
    "εκπ"."τκ"=TEMP."Τ.Κ.",
    "εκπ"."τηλεφωνο"=TEMP."Τηλέφωνο εκπαιδευτικού",
    "εκπ"."τηλεφωνο_κιν"=TEMP."Κινητό Τηλέφωνο εκπαιδευτικού",
    "εκπ"."τηλεφωνο_2"=TEMP."2ο Τηλέφωνο εκπαιδευτικού",
    "εκπ"."email"=TEMP."Email εκπαιδευτικού",
    "εκπ"."διευθυντης"=TEMP."Διευθυντής Σχολείου",
    "εκπ"."υποδιευθυντης"=TEMP."Υποδιευθυντής Σχολείου",
    "εκπ"."υποχρ_ωραριο_υπηρ_φορεα"=TEMP."Ώρες Υποχ. Διδακτικού Ωραρίου Υπηρέτησης στο Φορέα",
    "εκπ"."μειωση_ωραριου"=TEMP."Μείωση Ωραρίου"
FROM "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
JOIN TEMP 
    ON "εκπ"."αμ" = TEMP."Α.Μ.";

UPDATE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
SET
    "φυλο_id" = "φ".id,
    "κατηγορια_μοριοδ_id" = "κμ".id,
    "περιοχη_μεταθ_id" = "πμ".id,
    "σχεση_εργ_id" = "σχερ".id,
    "ειδικοτητα_κωδ" = "ειδ1".id,
    "ειδικοτητα_2_κωδ" = "ειδ2".id
FROM TEMP
JOIN "ΦΥΛΟ" "φ"
    ON "φ"."φυλο" = TEMP."Φύλο"
JOIN "ΚΑΤΗΓΟΡΙΑ_ΜΟΡΙΟΔΟΤΗΣΗΣ" "κμ"
    ON "κμ"."κατηγορια_μοριοδ" = TEMP."Κατηγορία Μοριοδότησης"
JOIN "ΠΕΡΙΟΧΕΣ_ΜΕΤΑΘΕΣΗΣ" "πμ"
    ON "πμ"."περιοχη_μεταθ" = TEMP."Περιοχή Μετάθεσης Εκπαιδευτικού"
JOIN "ΣΧΕΣΗ_ΕΡΓΑΣΙΑΣ" "σχερ"
    ON "σχερ"."σχεση_ερ" = TEMPt."Σχέση Εργασίας"
JOIN "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ1"
    ON "ειδ1"."ειδικ_κωδικος" = TEMP."Κωδικός Κύριας Ειδικότητας"
LEFT JOIN "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ2"
    ON "ειδ2"."ειδικ_κωδικος" = TEMP."Κωδικός 2ης Ειδικότητας"
WHERE "εκπ"."αμ" = TEMP."Α.Μ.";