IF NOT EXISTS (SELECT "εκπ".id FROM 
"ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ" 
JOIN TEMP 
ON "εκπ"."αφμ" = TEMP."Α.Φ.Μ."
LIMIT 1)
BEGIN
INSERT INTO "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" 
    (
        "ονομα",
        "επωνυμο" ,
        "πατρωνυμο",
        "αμ",
        "αφμ",
        "διευθυνση_κατ",
        "τκ",
        "τηλεφωνο",
        "τηλεφωνο_κιν",
        "τηλεφωνο_2",
        "email",
        "διευθυντης",
        "υποδιευθυντης",
        "υποχρ_ωραριο_υπηρ_φορεα",
        "μειωση_ωραριου")        
SELECT 
        "Όνομα",
        "Επώνυμο",
        "Πατρώνυμο",
        "Α.Μ.",
        "Α.Φ.Μ.",
        "Διεύθυνση Κατοικίας",
        "Τ.Κ.",
        "Τηλέφωνο εκπαιδευτικού",
        "Κινητό Τηλέφωνο εκπαιδευτικού",
        "2ο Τηλέφωνο εκπαιδευτικού",
        "Email εκπαιδευτικού",
        "Διευθυντής Σχολείου",
        "Υποδιευθυντής Σχολείου",
        "Ώρες Υποχ. Διδακτικού Ωραρίου Υπηρέτησης στο Φορέα",
        "Μείωση Ωραρίου"
FROM TEMP;

INSERT INTO "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" (
        "φυλο_id",
        "κατηγορια_μοριοδ_id",
        "περιοχη_μεταθ_id",
        "σχεση_εργ_id",
        "ειδικοτητα_κωδ",
        "ειδικοτητα_2_κωδ"
        )
VALUES
    ( 
        SELECT "ΦΥΛΟ".id FROM "ΦΥΛΟ" JOIN TEMP ON "ΦΥΛΟ"."φυλο"=TEMP."Φύλο",
        SELECT "κμ".id FROM "ΚΑΤΗΓΟΡΙΑ_ΜΟΡΙΟΔΟΤΗΣΗΣ" "κμ" JOIN TEMP ON "κμ"."κατηγορια_μοριοδ"=TEMP."Κατηγορία Μοριοδότησης",
        SELECT "πμ".id FROM "ΠΕΡΙΟΧΕΣ_ΜΕΤΑΘΕΣΗΣ" "πμ" JOIN TEMP ON "πμ"."περιοχη_μεταθ"=TEMP."Περιοχή Μετάθεσης Εκπαιδευτικού",
        SELECT "σχερ".id FROM "ΣΧΕΣΗ_ΕΡΓΑΣΙΑΣ" "σχερ" JOIN TEMP ON "σχερ"."σχεση_ερ"=TEMP."Σχέση Εργασίας",
        SELECT "ειδ1".id FROM "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ1" JOIN TEMP ON "ειδ1"."ειδικ_κωδικος"=TEMP."Κωδικός Κύριας Ειδικότητας",
        SELECT "ειδ2".id FROM "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ2" LEFT JOIN TEMP ON "ειδ2"."ειδικ_κωδικος"=TEMP."Κωδικός 2ης Ειδικότητας"
    )
END
ELSE
BEGIN
UPDATE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
SET
    "εκπ"."ονομα"=TEMP."Όνομα",
    "εκπ"."επωνυμο"=TEMP."Επώνυμο",
    "εκπ"."πατρωνυμο"=TEMP."Πατρώνυμο",
    "εκπ"."αμ"=TEMP."Α.Μ." ,
    "εκπ"."αφμ"=TEMP."Α.Φ.Μ.",
    "εκπ"."διευθυνση_κατ"=TEMP."Διεύθυνση Κατοικίας" ,
    "εκπ"."τκ"=TEMP."Τ.Κ.",
    "εκπ"."τηλεφωνο"=TEMP."Τηλέφωνο εκπαιδευτικού",
    "εκπ"."τηλεφωνο_κιν"=TEMP."Κινητό Τηλέφωνο εκπαιδευτικού",
    "εκπ"."τηλεφωνο_2"=TEMP."2ο Τηλέφωνο εκπαιδευτικού",
    "εκπ"."email"=TEMP."Email εκπαιδευτικού",
    "εκπ"."διευθυντης"=TEMP."Διευθυντής Σχολείου",
    "εκπ"."υποδιευθυντης"=TEMP."Υποδιευθυντής Σχολείου",
    "εκπ"."υποχρ_ωραριο_υπηρ_φορεα"=TEMP."Ώρες Υποχ. Διδακτικού Ωραρίου Υπηρέτησης στο Φορέα",
    "εκπ"."μειωση_ωραριου"=TEMP."Μείωση Ωραρίου"
FROM "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
JOIN TEMP 
    ON "εκπ"."αφμ" = TEMP."Α.Φ.Μ.";

UPDATE "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
SET
    "φυλο_id" = "φ".id,
    "κατηγορια_μοριοδ_id" = "κμ".id,
    "περιοχη_μεταθ_id" = "πμ".id,
    "σχεση_εργ_id" = "σχερ".id,
    "ειδικοτητα_κωδ" = "ειδ1".id,
    "ειδικοτητα_2_κωδ" = "ειδ2".id
FROM TEMP
JOIN "ΦΥΛΟ" "φ"
    ON "φ"."φυλο" = TEMP."Φύλο"
JOIN "ΚΑΤΗΓΟΡΙΑ_ΜΟΡΙΟΔΟΤΗΣΗΣ" "κμ"
    ON "κμ"."κατηγορια_μοριοδ" = TEMP."Κατηγορία Μοριοδότησης"
JOIN "ΠΕΡΙΟΧΕΣ_ΜΕΤΑΘΕΣΗΣ" "πμ"
    ON "πμ"."περιοχη_μεταθ" = TEMP."Περιοχή Μετάθεσης Εκπαιδευτικού"
JOIN "ΣΧΕΣΗ_ΕΡΓΑΣΙΑΣ" "σχερ"
    ON "σχερ"."σχεση_ερ" = TEMPt."Σχέση Εργασίας"
JOIN "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ1"
    ON "ειδ1"."ειδικ_κωδικος" = TEMP."Κωδικός Κύριας Ειδικότητας"
LEFT JOIN "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ2"
    ON "ειδ2"."ειδικ_κωδικος" = TEMP."Κωδικός 2ης Ειδικότητας"
WHERE "εκπ"."αμ" = TEMP."Α.Φ.Μ.";


--! SXOLEIA

IF NOT EXISTS (SELECT "σχλ".id FROM 
"ΣΧΟΛΕΙΑ" "σχλ" 
JOIN TEMP 
ON "σχλ"."ονομασια" = TEMP."Ονομασία Σχολείου"
LIMIT 1)
BEGIN
INSERT INTO "ΣΧΟΛΕΙΑ" 
    (
        "ονομασια",
        "τηλεφωνο",
        "fax",
        "email")        
SELECT 
        "Ονομασία Σχολείου",
        "Τηλέφωνο",
        "Fax",
        "Email"
FROM TEMP;

INSERT INTO "ΣΧΟΛΕΙΑ"(
        "ομαδα_id",
        "ειδος_id",
        "τυπος_id",
        "κωδικος_id",
        "δημος_id",
        "δημ_ενοτητα_id",
        "κοινοτητα_id"
        )
VALUES
    ( 
        SELECT "ομσχ".id FROM "ΟΜΑΔΑ_ΣΧΟΛΕΙΟΥ" "ομσχ" JOIN TEMP ON "ομσχ"."ομαδα"=TEMP."Ομάδα Σχολείου",
        SELECT "ειδσχ".id FROM "ΕΙΔΟΣ_ΣΧΟΛΕΙΟΥ" "ειδσχ" JOIN TEMP ON "ειδσχ"."ειδος"=TEMP."Είδος Σχολείου",
        SELECT "τπσχ".id FROM "ΤΥΠΟΣ_ΣΧΟΛΕΙΟΥ" "τπσχ" JOIN TEMP ON "τπσχ"."τυπος"=TEMP."Τύπος Σχολείου",
        SELECT "κωδσχ".id FROM "ΚΩΔΙΚΟΣ_ΣΧΟΛΕΙΟΥ" "κωδσχ" JOIN TEMP ON "κωδσχ"."κωδικος"=TEMP."Κωδικός Σχολείου",
        SELECT "δημσχ".id FROM "ΔΗΜΟΣ_ΣΧΟΛΕΙΟΥ" "δημσχ" JOIN TEMP ON "δημσχ"."δημος"=TEMP."Δήμος",
        SELECT "δενσχ".id FROM "ΔΗΜΟΤΙΚΗ_ΕΝΟΤΗΤΑ" "δενσχ" LEFT JOIN TEMP ON "δενσχ"."δημ_ενοτητα"=TEMP."Δημοτική Ενότητα",
        SELECT "κντσχ".id FROM "ΚΟΙΝΟΤΗΤΑ_ΣΧΟΛΕΙΟΥ" "κντσχ" LEFT JOIN TEMP ON "κντσχ"."κοινοτητα"=TEMP."Κοινότητα"
    )
END
ELSE
BEGIN
UPDATE "ΣΧΟΛΕΙΑ" "σχλ"
SET
    "σχλ"."ονομασια"=TEMP."Ονομασία Σχολείου",
    "σχλ"."τηλεφωνο"=TEMP."Τηλέφωνο",
    "σχλ"."fax"=TEMP."Fax",
    "σχλ"."email"=TEMP."Email"
FROM "ΣΧΟΛΕΙΑ" "σχλ"
JOIN TEMP 
    ON "σχλ"."ονομασια" = TEMP."Ονομασία Σχολείου";

UPDATE "ΣΧΟΛΕΙΑ" "σχλ"
SET
    "ομαδα_id" = "ομσχ".id,
    "ειδος_id" = "ειδσχ".id,
    "τυπος_id" = "τπσχ".id,
    "κωδικος_id" = "κωδσχ".id,
    "δημος_id" = "δημσχ".id,
    "δημ_ενοτητα_id" = "δενσχ".id,
    "κοινοτητα_id" = "κντσχ".id
FROM TEMP
JOIN "ΟΜΑΔΑ_ΣΧΟΛΕΙΟΥ" "ομσχ"
    ON "ομσχ"."ομαδα"=TEMP."Ομάδα Σχολείου"
JOIN "ΕΙΔΟΣ_ΣΧΟΛΕΙΟΥ" "ειδσχ"
    ON "ειδσχ"."ειδος"=TEMP."Είδος Σχολείου"
JOIN "ΤΥΠΟΣ_ΣΧΟΛΕΙΟΥ" "τπσχ"
    ON "τπσχ"."τυπος"=TEMP."Τύπος Σχολείου"
JOIN  "ΚΩΔΙΚΟΣ_ΣΧΟΛΕΙΟΥ" "κωδσχ"
    ON "κωδσχ"."κωδικος"=TEMP."Κωδικός Σχολείου"
JOIN "ΔΗΜΟΣ_ΣΧΟΛΕΙΟΥ" "δημσχ"
    ON "δημσχ"."δημος"=TEMP."Δήμος"
JOIN "ΔΗΜΟΤΙΚΗ_ΕΝΟΤΗΤΑ" "δενσχ"
    ON "δενσχ"."δημ_ενοτητα"=TEMP."Δημοτική Ενότητα"
LEFT JOIN "ΚΟΙΝΟΤΗΤΑ_ΣΧΟΛΕΙΟΥ" "κντσχ"
    ON ON "κντσχ"."κοινοτητα"=TEMP."Κοινότητα"
WHERE "σχλ"."ονομασια" = TEMP."Ονομασία Σχολείου";

--! TOPOTHETISEIS

IF NOT EXISTS (SELECT "τπθ".id FROM 
"ΤΟΠΟΘΕΤΗΣΕΙΣ" "τπθ" 
JOIN TEMP 
ON "τπθ"."αριθμ_πρωτοκ" = TEMP."Αριθμός Πρωτοκόλλου"
LIMIT 1)
BEGIN
INSERT INTO "ΤΟΠΟΘΕΤΗΣΕΙΣ" 
    (
        "οργανο_αποφασης",
        "οργανο_τοποθετ" ,
        "αριθμ_πρωτοκ",
        "αριθμ_πραξης",
        "ημερ_πραξης",
        "αριθμ_πραξης_αναληψ",
        "ημερ_αναληψης",
        "ημερ_αποφασης",
        "εναρξη_ισχυος",
        "ληξη_ισχυος",
        "αριθμ_πραξης_αποχωρ",
        "ημερ_αποχωρ",
        "τελευτ_ενημερ")        
SELECT 
        "Υπηρεσιακό Όργανο Απόφασης",
        "Υπηρεσιακό Όργανο Τοποθέτησης",
        "Αριθμός Πρωτοκόλλου",
        "Αριθμός Πράξης",
        "Ημερομηνία Πράξης",
        "Αριθμός Πράξης Ανάληψης",
        "Ημερομηνία Ανάληψης",
        "Ημερομηνία Απόφασης",
        "Ισχύει από",
        "Ισχύει έως",
        "Αριθμός Πράξης Αποχώρησης",
        "Ημερομηνία Αποχώρησης",
        "Τελευταία Ενημέρωση"
FROM TEMP;

INSERT INTO "ΤΟΠΟΘΕΤΗΣΕΙΣ" (
        "εκπαιδευτικος_id",
        "σχολειο_id",
        "σχεση_τοποθ_id"
        )
VALUES
    ( 
        SELECT "εκπ".id FROM "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ" JOIN TEMP ON "εκπ"."αφμ" = TEMP."Α.Φ.Μ.",
        SELECT "σχλ".id FROM "ΣΧΟΛΕΙΑ" "σχλ" JOIN TEMP ON "σχλ"."ονομασια"=TEMP."Ονομασία Σχολείου",
        SELECT "σχτπθ".id FROM "ΣΧΕΣΕΙΣ_ΤΟΠΟΘΕΤΗΣΗΣ" "σχτπθ" JOIN TEMP ON "σχτπθ"."σχεση_τοποθ"=TEMP."Σχέση Τοποθέτησης",
    )
END
ELSE
BEGIN
UPDATE "ΤΟΠΟΘΕΤΗΣΕΙΣ" "τπθ"
SET
    "τπθ"."οργανο_αποφασης"=TEMP."Υπηρεσιακό Όργανο Απόφασης",
    "τπθ"."οργανο_τοποθετ"=TEMP."Υπηρεσιακό Όργανο Τοποθέτησης",
    "τπθ"."αριθμ_πρωτοκ"=TEMP."Αριθμός Πρωτοκόλλου",
    "τπθ"."αριθμ_πραξης"=TEMP."Αριθμός Πράξης",
    "τπθ"."ημερ_πραξης"=TEMP."Ημερομηνία Πράξης",
    "τπθ"."αριθμ_πραξης_αναληψ"=TEMP."Αριθμός Πράξης Ανάληψης",
    "τπθ"."ημερ_αναληψης"=TEMP."Ημερομηνία Ανάληψης",
    "τπθ"."ημερ_αποφασης"=TEMP."Ημερομηνία Απόφασης",
    "τπθ"."εναρξη_ισχυος"=TEMP."Ισχύει από",
    "τπθ"."ληξη_ισχυος"=TEMP."Ισχύει έως",
    "τπθ"."αριθμ_πραξης_αποχωρ"=TEMP."Αριθμός Πράξης Αποχώρησης",
    "τπθ"."ημερ_αποχωρ"=TEMP."Ημερομηνία Αποχώρησης",
    "τπθ"."τελευτ_ενημερ"=TEMP."Τελευταία Ενημέρωση"
FROM "ΤΟΠΟΘΕΤΗΣΕΙΣ" "τπθ"
JOIN TEMP 
    ON "τπθ"."αριθμ_πρωτοκ" = TEMP."Αριθμός Πρωτοκόλλου";

UPDATE "ΤΟΠΟΘΕΤΗΣΕΙΣ" "τπθ"
SET
    "εκπαιδευτικος_id" = "εκπ".id,
    "σχολειο_id" = "σχλ".id,
    "σχεση_τοποθ_id" = "σχτπθ".id
FROM TEMP

JOIN "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
    ON "εκπ"."αφμ" = TEMP."Α.Φ.Μ."
JOIN "ΣΧΟΛΕΙΑ" "σχλ"
    ON "σχλ"."ονομασια"=TEMP."Ονομασία Σχολείου"
LEFT JOIN "ΣΧΕΣΕΙΣ_ΤΟΠΟΘΕΤΗΣΗΣ" "σχτπθ"
    ON "σχτπθ"."σχεση_τοποθ"=TEMP."Σχέση Τοποθέτησης"
WHERE "τπθ"."αριθμ_πρωτοκ" = TEMP."Αριθμός Πρωτοκόλλου";

--! ORARIA

IF NOT EXISTS (SELECT "ωρ".id FROM 
"ΩΡΑΡΙΑ" "ωρ" 
JOIN "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
ON "ωρ"."εκπαιδευτικος_id" = "εκπ".id
JOIN TEMP 
ON "εκπ".id = TEMP."Α.Φ.Μ."
LIMIT 1)
BEGIN
INSERT INTO "ΩΡΑΡΙΑ" 
    (
        "αναθεση_α",
        "αναθεση_β" ,
        "αναθεση_γ",
        "προσθ_τμημ",
        "αναθεση_αλλες",
        "συμπληρωση",
        "υπερωριες",
        "γραμματ_υποστ",
        "αναθεση_α_2η_ειδικ",
        "αναθεση_β_2η_ειδικ",
        "αναθεση_γ_2η_ειδικ",
        "συνδιδασκ_ημιωρο")        
SELECT 
        "Α Ανάθεση Συνολικά",
        "Β Ανάθεση Συνολικά",
        "Γ Ανάθεση Συνολικά",
        "Προσθ. Τμημ. Συνολικά",
        "’λλες Αναθέσεις Συνολικά",
        "Συμπλήρωση Ωραρίου",
        "Υπερωρίες σε τμήματα της ίδιας μονάδας",
        "Γραμματειακή Υποστήριξη",
        "Α Ανάθεση από 2η Ειδικότητα",
        "Β Ανάθεση από 2η Ειδικότητα",
        "Γ Ανάθεση από 2η Ειδικότητα",
        "Ανήκει σε Συνδιδασκαλία Ημιώρου Τμήματος"
FROM TEMP;

IINSERT INTO "ΩΡΑΡΙΑ" (
        "εκπαιδευτικος_id",
        "σχολειο_id"
        )
VALUES
    ( 
        SELECT "εκπ".id FROM "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ" JOIN TEMP ON "εκπ"."αφμ" = TEMP."Α.Φ.Μ.",
        SELECT "σχλ".id FROM "ΣΧΟΛΕΙΑ" "σχλ" JOIN TEMP ON "σχλ"."ονομασια"=TEMP."Ονομασία Σχολείου"
    )
END
ELSE
BEGIN
UPDATE "ΩΡΑΡΙΑ" "ωρ"
SET
    "ωρ"."αναθεση_α"=TEMP."Α Ανάθεση Συνολικά",
    "ωρ"."αναθεση_β"=TEMP."Β Ανάθεση Συνολικά",
    "ωρ"."αναθεση_γ"=TEMP."Γ Ανάθεση Συνολικά",
    "ωρ"."προσθ_τμημ"=TEMP. "Προσθ. Τμημ. Συνολικά",
    "ωρ"."αναθεση_αλλες"=TEMP."’λλες Αναθέσεις Συνολικά",
    "ωρ"."συμπληρωση"=TEMP."Συμπλήρωση Ωραρίου",
    "ωρ"."υπερωριες"=TEMP."Υπερωρίες σε τμήματα της ίδιας μονάδας",
    "ωρ"."γραμματ_υποστ"=TEMP."Γραμματειακή Υποστήριξη",
    "ωρ"."αναθεση_α_2η_ειδικ"=TEMP."Α Ανάθεση από 2η Ειδικότητα",
    "ωρ"."αναθεση_β_2η_ειδικ"=TEMP."Β Ανάθεση από 2η Ειδικότητα",
    "ωρ"."αναθεση_γ_2η_ειδικ"=TEMP. "Γ Ανάθεση από 2η Ειδικότητα",
    "ωρ"."συνδιδασκ_ημιωρο"=TEMP."Ανήκει σε Συνδιδασκαλία Ημιώρου Τμήματος"
FROM "ΩΡΑΡΙΑ" "ωρ" 
JOIN "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
ON "ωρ"."εκπαιδευτικος_id" = "εκπ".id
JOIN TEMP 
ON "εκπ".id = TEMP."Α.Φ.Μ.";

UPDATE "ΩΡΑΡΙΑ" "ωρ"
SET
    "εκπαιδευτικος_id" = "εκπ".id,
    "σχολειο_id" = "σχλ".id
FROM TEMP

JOIN "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
    ON "εκπ"."αφμ" = TEMP."Α.Φ.Μ."
LEFT JOIN "ΣΧΟΛΕΙΑ" "σχλ"
    ON "σχλ"."ονομασια"=TEMP."Ονομασία Σχολείου";