INSERT INTO "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
    (
        "ονομα",
        "επωνυμο" ,
        "πατρωνυμο",
        "αμ",
        "αφμ",
        "διευθυνση_κατ",
        "τκ",
        "τηλεφωνο",
        "τηλεφωνο_κιν",
        "τηλεφωνο_2",
        "email",
        "διευθυντης",
        "υποδιευθυντης",
        "υποχρ_ωραριο_υπηρ_φορεα",
        "μειωση_ωραριου",
        "φυλο_id",
        "κατηγορια_μοριοδ_id",
        "περιοχη_μεταθ_id",
        "σχεση_εργ_id",
        "ειδικοτητα_κωδ",
        "ειδικοτητα_2_κωδ")        
SELECT 
        TEMP."Όνομα",
        TEMP."Επώνυμο",
        TEMP."Πατρώνυμο",
        TEMP."Α.Μ.",
        TEMP."Α.Φ.Μ.",
        TEMP."Διεύθυνση Κατοικίας",
        TEMP."Τ.Κ.",
        TEMP."Τηλέφωνο εκπαιδευτικού",
        TEMP."Κινητό Τηλέφωνο εκπαιδευτικού",
        TEMP."2ο Τηλέφωνο εκπαιδευτικού",
        TEMP."Email εκπαιδευτικού",
        TEMP."Διευθυντής Σχολείου",
        TEMP."Υποδιευθυντής Σχολείου",
        TEMP."Ώρες Υποχ. Διδακτικού Ωραρίου Υπηρέτησης στο Φορέα",
        TEMP."Μείωση Ωραρίου",
        "ΦΥΛΟ".id,
        "κμ".id,
        "πμ".id,
        "σχερ".id,
        "ειδ1".id,
        "ειδ2".id
FROM TEMP
LEFT JOIN "ΦΥΛΟ"
    ON "ΦΥΛΟ"."φυλο"=TEMP."Φύλο"
LEFT JOIN "ΚΑΤΗΓΟΡΙΑ_ΜΟΡΙΟΔΟΤΗΣΗΣ" "κμ"
    ON "κμ"."κατηγορια_μοριοδ"=TEMP."Κατηγορία Μοριοδότησης"
LEFT JOIN "ΠΕΡΙΟΧΕΣ_ΜΕΤΑΘΕΣΗΣ" "πμ"
    ON "πμ"."περιοχη_μεταθ"=TEMP."Περιοχή Μετάθεσης Εκπαιδευτικού"
LEFT JOIN "ΣΧΕΣΗ_ΕΡΓΑΣΙΑΣ" "σχερ"
    ON "σχερ"."σχεση_ερ"=TEMP."Σχέση Εργασίας"
LEFT JOIN "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ1"
    ON "ειδ1"."ειδικ_κωδικος"=TEMP."Κωδικός Κύριας Ειδικότητας"
LEFT JOIN "ΕΙΔΙΚΟΤΗΤΕΣ" "ειδ2"
    ON "ειδ2"."ειδικ_κωδικος"=TEMP."Κωδικός 2ης Ειδικότητας"

ON CONFLICT ("αφμ") DO UPDATE
SET
    "ονομα"=EXCLUDED."ονομα",
    "επωνυμο"=EXCLUDED."επωνυμο",
    "πατρωνυμο"=EXCLUDED."πατρωνυμο",
    "αμ"=EXCLUDED."αμ" ,
    "αφμ"=EXCLUDED."αφμ",
    "διευθυνση_κατ"=EXCLUDED."διευθυνση_κατ",
    "τκ"=EXCLUDED."τκ",
    "τηλεφωνο"=EXCLUDED."τηλεφωνο",
    "τηλεφωνο_κιν"=EXCLUDED."τηλεφωνο_κιν",
    "τηλεφωνο_2"=EXCLUDED."τηλεφωνο_2",
    "email"=EXCLUDED."email",
    "διευθυντης"=EXCLUDED."διευθυντης",
    "υποδιευθυντης"=EXCLUDED."υποδιευθυντης",
    "υποχρ_ωραριο_υπηρ_φορεα"=EXCLUDED."υποχρ_ωραριο_υπηρ_φορεα",
    "μειωση_ωραριου"=EXCLUDED."μειωση_ωραριου",
    "φυλο_id"=EXCLUDED."φυλο_id",
    "κατηγορια_μοριοδ_id"=EXCLUDED."κατηγορια_μοριοδ_id",
    "περιοχη_μεταθ_id"=EXCLUDED."περιοχη_μεταθ_id",
    "σχεση_εργ_id"=EXCLUDED."σχεση_εργ_id",
    "ειδικοτητα_κωδ"=EXCLUDED."ειδικοτητα_κωδ",
    "ειδικοτητα_2_κωδ"=EXCLUDED."ειδικοτητα_2_κωδ";

--! SXOLEIA

INSERT INTO "ΣΧΟΛΕΙΑ" "σχλ"
    (
        "ονομασια",
        "τηλεφωνο",
        "fax",
        "email",
        "ομαδα_id",
        "ειδος_id",
        "τυπος_id",
        "κωδικος_id",
        "δημος_id",
        "δημ_ενοτητα_id",
        "κοινοτητα_id")        
SELECT 
        TEMP."Ονομασία Σχολείου",
        TEMP."Τηλέφωνο",
        TEMP."Fax",
        TEMP."Email",
        "ομσχ".id,
        "ειδσχ".id,
        "τπσχ".id,
        "κωδσχ".id,
        "δημσχ".id,
        "δενσχ".id,
        "κντσχ".id
FROM TEMP
LEFT JOIN "ΟΜΑΔΑ_ΣΧΟΛΕΙΟΥ" "ομσχ"
    ON "ομσχ"."ομαδα"=TEMP."Ομάδα Σχολείου"
LEFT JOIN "ΕΙΔΟΣ_ΣΧΟΛΕΙΟΥ" "ειδσχ"
    ON "ειδσχ"."ειδος"=TEMP."Είδος Σχολείου"
LEFT JOIN "ΤΥΠΟΣ_ΣΧΟΛΕΙΟΥ" "τπσχ"
    ON "τπσχ"."τυπος"=TEMP."Τύπος Σχολείου"
LEFT JOIN "ΚΩΔΙΚΟΣ_ΣΧΟΛΕΙΟΥ" "κωδσχ"
    ON "κωδσχ"."κωδικος"=TEMP."Κωδικός Σχολείου"
LEFT JOIN "ΔΗΜΟΣ_ΣΧΟΛΕΙΟΥ" "δημσχ"
    ON "δημσχ"."δημος"=TEMP."Δήμος"
LEFT JOIN "ΔΗΜΟΤΙΚΗ_ΕΝΟΤΗΤΑ" "δενσχ"
    ON "δενσχ"."δημ_ενοτητα"=TEMP."Δημοτική Ενότητα"
LEFT JOIN "ΚΟΙΝΟΤΗΤΑ_ΣΧΟΛΕΙΟΥ" "κντσχ"
    ON "κντσχ"."κοινοτητα"=TEMP."Κοινότητα"

ON CONFLICT ("oνομασια") DO UPDATE
SET

"ονομασια"=EXCLUDED."ονομασια",
"τηλεφωνο"=EXCLUDED."τηλεφωνο",
"fax"=EXCLUDED."fax",
"email"=EXCLUDED."email",
"ομαδα_id"=EXCLUDED."ομαδα_id",
"ειδος_id"=EXCLUDED."ειδος_id",
"τυπος_id"=EXCLUDED."τυπος_id",
"κωδικος_id"=EXCLUDED."κωδικος_id",
"δημος_id"=EXCLUDED."δημος_id",
"δημ_ενοτητα_id"=EXCLUDED."δημ_ενοτητα_id",
"κοινοτητα_id"=EXCLUDED."κοινοτητα_id";

--! TOPOTHETISEIS

INSERT INTO "ΤΟΠΟΘΕΤΗΣΕΙΣ" "τπθ"
    (
        "οργανο_αποφασης",
        "οργανο_τοποθετ" ,
        "αριθμ_πρωτοκ",
        "αριθμ_πραξης",
        "ημερ_πραξης",
        "αριθμ_πραξης_αναληψ",
        "ημερ_αναληψης",
        "ημερ_αποφασης",
        "εναρξη_ισχυος",
        "ληξη_ισχυος",
        "αριθμ_πραξης_αποχωρ",
        "ημερ_αποχωρ",
        "τελευτ_ενημερ",
        "εκπαιδευτικος_id",
        "σχολειο_id",
        "σχεση_τοποθ_id")        
SELECT 
        TEMP."Υπηρεσιακό Όργανο Απόφασης",
        TEMP."Υπηρεσιακό Όργανο Τοποθέτησης",
        TEMP."Αριθμός Πρωτοκόλλου",
        TEMP."Αριθμός Πράξης",
        TEMP."Ημερομηνία Πράξης",
        TEMP."Αριθμός Πράξης Ανάληψης",
        TEMP."Ημερομηνία Ανάληψης",
        TEMP."Ημερομηνία Απόφασης",
        TEMP."Ισχύει από",
        TEMP."Ισχύει έως",
        TEMP."Αριθμός Πράξης Αποχώρησης",
        TEMP."Ημερομηνία Αποχώρησης",
        TEMP."Τελευταία Ενημέρωση",
        "εκπ".id,
        "σχλ".id,
        "σχτπθ".id
FROM TEMP
LEFT JOIN "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
    ON "εκπ"."αφμ" = TEMP."Α.Φ.Μ."
LEFT JOIN "ΣΧΟΛΕΙΑ" "σχλ"
    ON "σχλ"."ονομασια"=TEMP."Ονομασία Σχολείου"
LEFT JOIN "ΣΧΕΣΕΙΣ_ΤΟΠΟΘΕΤΗΣΗΣ" "σχτπθ"
    ON "σχτπθ"."σχεση_τοποθ"=TEMP."Σχέση Τοποθέτησης"

ON CONFLICT ("αριθμ_πρωτοκ") DO UPDATE
SET

        "οργανο_αποφασης"=EXCLUDED."οργανο_αποφασης",
        "οργανο_τοποθετ"=EXCLUDED."οργανο_τοποθετ",
        "αριθμ_πρωτοκ"=EXCLUDED."αριθμ_πρωτοκ",
        "αριθμ_πραξης"=EXCLUDED."αριθμ_πραξης",
        "ημερ_πραξης"=EXCLUDED."ημερ_πραξης",
        "αριθμ_πραξης_αναληψ"=EXCLUDED."αριθμ_πραξης_αναληψ",
        "ημερ_αναληψης"=EXCLUDED."ημερ_αναληψης",
        "ημερ_αποφασης"=EXCLUDED."ημερ_αποφασης",
        "εναρξη_ισχυος"=EXCLUDED."εναρξη_ισχυος",
        "ληξη_ισχυος"=EXCLUDED."ληξη_ισχυος",
        "αριθμ_πραξης_αποχωρ"=EXCLUDED."αριθμ_πραξης_αποχωρ",
        "ημερ_αποχωρ"=EXCLUDED."ημερ_αποχωρ",
        "τελευτ_ενημερ"=EXCLUDED."τελευτ_ενημερ",
        "εκπαιδευτικος_id"=EXCLUDED."εκπαιδευτικος_id",
        "σχολειο_id"=EXCLUDED."σχολειο_id",
        "σχεση_τοποθ_id"=EXCLUDED."σχεση_τοποθ_id";

--! ORARIA

INSERT INTO "ΩΡΑΡΙΑ" "ωρ"
    (
        "εκπαιδευτικος_id",
        "σχολειο_id",
        "αναθεση_α",
        "αναθεση_β" ,
        "αναθεση_γ",
        "προσθ_τμημ",
        "αναθεση_αλλες",
        "συμπληρωση",
        "υπερωριες",
        "γραμματ_υποστ",
        "αναθεση_α_2η_ειδικ",
        "αναθεση_β_2η_ειδικ",
        "αναθεση_γ_2η_ειδικ",
        "συνδιδασκ_ημιωρο")        
SELECT 
       "εκπ"."id",
       "σχλ"."id",
        TEMP."Α Ανάθεση Συνολικά",
        TEMP."Β Ανάθεση Συνολικά",
        TEMP."Γ Ανάθεση Συνολικά",
        TEMP."Προσθ. Τμημ. Συνολικά",
        TEMP."’λλες Αναθέσεις Συνολικά",
        TEMP."Συμπλήρωση Ωραρίου",
        TEMP."Υπερωρίες σε τμήματα της ίδιας μονάδας",
        TEMP."Γραμματειακή Υποστήριξη",
        TEMP."Α Ανάθεση από 2η Ειδικότητα",
        TEMP."Β Ανάθεση από 2η Ειδικότητα",
        TEMP."Γ Ανάθεση από 2η Ειδικότητα",
        TEMP."Ανήκει σε Συνδιδασκαλία Ημιώρου Τμήματος"
FROM TEMP
LEFT JOIN "ΕΚΠΑΙΔΕΥΤΙΚΟΙ" "εκπ"
    ON "εκπ"."αφμ" = TEMP."Α.Φ.Μ."
LEFT JOIN "ΣΧΟΛΕΙΑ" "σχλ"
    ON "σχλ"."ονομασια"=TEMP."Ονομασία Σχολείου"

ON CONFLICT ("εκπαιδευτικος_id") DO UPDATE
SET

 "αναθεση_α"=EXCLUDED."αναθεση_α",
 "αναθεση_β"=EXCLUDED."αναθεση_β",
 "αναθεση_γ"=EXCLUDED."αναθεση_γ",
 "προσθ_τμημ"=EXCLUDED."προσθ_τμημ",
 "αναθεση_αλλες"=EXCLUDED."αναθεση_αλλες",
 "συμπληρωση"=EXCLUDED."συμπληρωση",
 "υπερωριες"=EXCLUDED."υπερωριες",
 "γραμματ_υποστ"=EXCLUDED."γραμματ_υποστ",
 "αναθεση_α_2η_ειδικ"=EXCLUDED."αναθεση_α_2η_ειδικ",
 "αναθεση_β_2η_ειδικ"=EXCLUDED."αναθεση_β_2η_ειδικ",
 "αναθεση_γ_2η_ειδικ"=EXCLUDED."αναθεση_γ_2η_ειδικ",
 "συνδιδασκ_ημιωρο"=EXCLUDED."συνδιδασκ_ημιωρο",
 "εκπαιδευτικος_id"=EXCLUDED."εκπαιδευτικος_id",
 "σχολειο_id"=EXCLUDED."σχολειο_id";
